{
    "ws": [],
    "shall": [],
    "similarly": [
        {
            "src": "This task is carried out similarly to the previous one.",
            "dst": "Это задание выполняется аналогично предыдущему."
        },
        {
            "src": "He is very similar to his brother.",
            "dst": "Он очень похож на своего брата."
        }
    ],
    "previous": [
        {
            "src": "The previous owner sold the house because he moved to another city.",
            "dst": "Предыдущий владелец продал дом, потому что переехал в другой город."
        },
        {
            "src": "The previous tenant planted some trees around the house.",
            "dst": "Предыдущий арендатор посадил несколько деревьев вокруг дома."
        },
        {
            "src": "The previous owner sold the house because he moved.",
            "dst": "Прежний владелец продал дом, потому что переехал."
        },
        {
            "src": "The candidate has good references from his previous job.",
            "dst": "У кандидата хорошие рекомендации с прошлого места работы."
        }
    ],
    "pot": [
        {
            "src": "The water in the pot is already boiling.",
            "dst": "Вода в горшке уже закипает."
        },
        {
            "src": "The water in the pot is boiling.",
            "dst": "В чайнике кипит вода."
        },
        {
            "src": "I am potting the flowers on the balcony.",
            "dst": "Я сажаю цветы в горшки на балконе."
        }
    ],
    "nat": [],
    "winograd": [],
    "skilled": [
        {
            "src": "She is a skilled nurse, so she can easily find a new job.",
            "dst": "Она квалифицированная медсестра, поэтому она легко найдёт новую работу."
        },
        {
            "src": "Skilled labour is always well-paid.",
            "dst": "Квалифицированный труд всегда хорошо оплачивается."
        },
        {
            "src": "The skilled technician quickly installed the new equipment.",
            "dst": "Умелый механик быстро установил новое оборудование."
        }
    ],
    "slicers": [],
    "adventures": [
        {
            "src": "The amusement park is an adventure for the entire family.",
            "dst": "Поездка в парк развлечений - это приключение для всей семьи."
        },
        {
            "src": "I did not want to take part in this dangerous adventure.",
            "dst": "Я не хотел участвовать в этой опасной авантюре."
        },
        {
            "src": "A visit to a zoo is a big adventure for children.",
            "dst": "Поход в зоопарк — это большое событие для детей."
        },
        {
            "src": "One day I will write a book about my adventures.",
            "dst": "Однажды я напишу книгу о своих похождениях."
        },
        {
            "src": "My wife loves adventure films with this actor.",
            "dst": "Моя жена любит приключенческие фильмы с этим актёром."
        },
        {
            "src": "He adventured all his money to business.",
            "dst": "Он рискнул всеми своими деньгами ради бизнеса."
        }
    ],
    "rebasing": [],
    "electric": [
        {
            "src": "The machine has an electric drive.",
            "dst": "У этого станка электрический привод."
        },
        {
            "src": "The electric circuit is protected by a fuse.",
            "dst": "Электрическая цепь защищена предохранителем."
        }
    ],
    "finish": [
        {
            "src": "The room looks nice but it still needs a finish.",
            "dst": "Комната выглядит мило, но ей всё ещё требуется отделка."
        },
        {
            "src": "The athlete reached the finish in record time.",
            "dst": "Спортсмен добрался до финиша за рекордное время."
        },
        {
            "src": "The president finished his speech with an appeal for world peace.",
            "dst": "Президент завершил свою речь призывом к миру во всём мире."
        },
        {
            "src": "He endeavoured to finish the project on time.",
            "dst": "Он приложил усилия, чтобы закончить проект вовремя."
        },
        {
            "src": "I will try to finish everything today.",
            "dst": "Я постараюсь закончить всё сегодня."
        },
        {
            "src": "The handyman finished the walls with oak panels.",
            "dst": "Мастер отделал стены дубовыми панелями."
        },
        {
            "src": "I want to finish the fireplace with ornamental stone.",
            "dst": "Я хочу отделать камин декоративным камнем."
        }
    ],
    "tesla": []
}