{
  "text": "Did you know that ninety percent \nof the information processed by  \nthe brain is visual? Human brain takes 13 \nmilliseconds to process an image, that's  \n60,000 times faster than processing text. \nPeople also retain 80% of what they see,  \ncompared with 20% of what they read \nand only 10% of what they hear.\nNo wonder, then, that data visualization \ntools are in high demand. Visuals provide  \nus with an effective way to get our point across, \nespecially nowadays, when we're dealing with poor  \ndata than ever. And not all visuals are created \nequally though, some help you uncover dangers or  \nopportunities that you never even knew to look \nfor. I'll cover my favorite Power BI visuals I  \nwish Excel had. You're going to see how easy it \nis to turn your data into actionable decisions.\nNumber one is the Ribbon Chart. This is great for \nviewing data over time and also keeping track of  \nrank changes. It's right here. Let's add it to \nour report and we get an idea of how it's going  \nto look, but let's bring it to life. We're going \nto add total quantity to the y-axis and let's add  \nan element of time to the x-axis. So here, I \njust have three months of data in this model,  \nI'll just add in the months. Now, I get \nsomething that looks like a column chart,  \nthe ribbon is going to form when I add a category \nto the legend. So, I want to take a look at  \nthe different article categories and how these \ndeveloped over time. Let's add that to the legend  \nand now, our ribbon comes to life. The way \nthis works is that the highest range is always  \ndisplayed on top. We can see our columns in the \nbackground. We have now stacked columns because  \nwe have different categories. So if I hover over \nthis, we can see the total quantity for business,  \nfor casual clothing, party, and so on. And, the \nbeauty is the lighter areas in between. This is  \nwhere we get to see the rank changes. Just like \nin the music charts, where you get to see a change  \nin rank, it's a similar concept here, and all of \nthis is built in. So our business clothing here,  \ndropped two ranks. It was number one in February, \nit became number three in March. And this one,  \nright here, that's our casual clothing, it went up \none rank to first place. Now, the ribbon chart can  \nbe a bit difficult to read, so we can make some \nadjustments here to make it easier. First of all,  \non the x-axis, we can turn off the title, let's \nturn on the data labels, and let's also activate  \nthis Zoom slider. Here, if you want to get a \ncloser look at January for that bottom category,  \nwe can zoom in and we see, oh yeah, this is \nour Sleep category and we sold 500 items.  \nNow, this can get quickly overcrowded, if you have \nmany different categories. So, it could make sense  \nto add a filter to the visual and just restrict \nit to your top categories. So, for a filter type,  \nwe would go with Top N, we're going to base this \non total quantity and we just, say, let's take  \na look at the top three categories. Number two \nis the decomposition tree. This is an AI Visual  \nand it lets you visualize data across multiple \ndimensions. You're going to find it right here,  \nlet's add that in. We get to pick what fields \nwe want to analyze, I'm going to go with profit.  \nNow, we can decide what we want to explain this \nby one field can be our article category another  \ncustomer gender and perhaps customer City now we \nget the Plus show up here we can choose how we  \nwant to split our data when I select this I have \nthe option between the different fields that I've  \nadded and also this part with high value and low \nvalue. Notice the light bulb here, that's the AI  \nfeature. This might help you uncover issues that \nyou didn't even know to look for. So, let's say,  \nI'm going to go with low value. The AI is going \nto get to work and decide what category it should  \nshow me. It picked City, Garland. We have negative \nprofit here. Where is it coming from? Let's dig  \ndeeper. Low value, just from our sleep category, \nand if we go again to gender, it's from other or  \nNA. Now, once we've picked what we want to see, \nwe can apply that same pattern to different values  \nhere. So, for example, for LA, if I just click \nhere, it's going to find the low value, so it  \npicked other/NA for gender, and it's coming from \nthe casual clothing category. To see the different  \ncategories for female, I just have to make a \nselection here and I can see party is where we  \nhave the lowest profit. Now whatever you want you \ncan start the process again and look for something  \nelse. So you could decide to look for high value. \nThis time the AI picked the gender category. Now  \nyou also don't have to use the AI feature, you \ncould go and slice and dice as you want. So  \nyou're going to go with gender, let's drill down \nfor male, by category and notice here, the party  \ncategory is making negative profit. And if I want \nto see where it's coming from, I'm going to drill  \ninto City. It's coming from Seattle. If you want \nto lock a field in place, you can. So notice,  \nwhen you hover over these, you get the lock \nicon, so if you always want to have your first  \ndrill down to be gender, you can lock it in place \nand then leave the rest flexible. Okay, so this  \nis a great visual for getting information about \nyour data that you didn't even know to look for.  \nNext up is the scatter chart. I know Excel \nhas one but it's not as cool as Power BI's.  \nCheck this out, we're going to add the scatter \nchart. Let's bring over the sales value to the  \nx-axis, profit to the y-axis, total quantity is \ngoing to go for the size of the legend. Okay,  \nI just have one bubble now, but we're going \nto split this by customer state, so I'm going  \nto add State as the legend. Now, I can see my \ndifferent bubbles here. So this one is California,  \nit's all the way up here. Now, what makes this \nso different to Excel, well, it's this part,  \nthe Play axis. We can add a time factor here, \nso I have my dates right here, in this case,  \nI just have three months of data, so I'm going \nto grab the month and drop it in the Play axis.  \nThis is also difficult to read with the legend up \nhere, so let's go and quickly format this visual,  \nturn off the legend, turn on the category \nlabels, and let's also make them bigger.  \nOkay, so California is all the way up here \nin March, but was it always like this? Well,  \nlet's play this. We see January, February and \nMarch. If you have data for longer time periods,  \nyou are going to be able to just play \nthis and understand the change over time.  \nAnd last, we have infographics and custom visuals. \nYou see, the great thing about Power BI is that,  \nyou aren't even restricted to what you see \nhere. You can go and grab more visuals.  \nFrom here, you get to search for what you want. \nI'm gonna go and grab the infographic designer.  \nLet's add it in, it was successfully \nimported and I can see it on the bottom here.  \nEach custom visual has its own settings but let me \nshow you something cool you can do with this one.  \nLet's add it in, add in gender and total quantity. \nI'm going to change up my measure to show values  \nas percent of grand total. Okay, so now, let's \ngo to formatting options and see what we have.  \nWe just get chart, we can pick between different \ntypes, I'm going to stick to column. We can turn  \noff the X/Y axis, but where can we add our shapes? \nWell, now here, we can add it in, right here.  \nOkay, let me just expand this so we can see \nthe options better. I'll bring it up and we get  \nspecific designer options. This is where we can \nadd in the different shapes that we want. If you  \nwant each column to have a different shape, which \nin this case I want, we're going to go to data  \nbinding off and select our data binding field, \nthis is gender. Now, we can select a different  \nshape for each of these. When I select this, I \ncan pick different shapes from here. Under people,  \nthere's a female one, let's go with that. Male, \nthis one right here. Other/NA, I don't find what  \nI want here. No problem, we can upload our own SVG \nfile. I happen to have one here let's select that,  \nand add it in. Now we can apply this and we see \nthese update. But I want them to have the same  \nheight, so I'm going to go to layout adjust this \nsetting to be outer. Okay, so things are looking  \nbetter. We want to add our filling based on the \npercentage, so fill percentage is going to be  \nbased on percentage of total quantity. But notice, \nfemale is fully filled in. I don't want that,  \nso we're going to add a maximum value of 1. And \nnow, the filling is updated accordingly. Now,  \nyou have more options so you can adjust the color, \nif you want. I'm going to turn this on and go with  \na light yellow color. You can also add the actual \npercentage to this, so we can go and add text.  \nI want the text to be dynamic, it should be a data \nlabel based on percentage of total quantity, let's  \napply that. Go back and adjust the formatting, \nlet's make it really big, make it bold and add  \nit to the bottom. Okay so, that looks good. Let's \nmake this smaller. Now, the great thing about  \nthis is that, it works similar to other Power BI \nvisuals. You can cross-highlight and cross-filter.  \nLet's say, we had a bar chart in place that was \nshowing our profit for the different categories.  \nWhen I select the different categories, my \nvisual is automatically cross-highlighted.  \nI hope this brief introduction to some cool Power \nBI visuals inspired you to be creative when you  \ndesign your reports, and also to experiment \na little bit. It just takes two minutes,  \nmaximum, I guess, to add a new chart and tweak it \na bit to see what it's capable of. If you have a  \nfavorite Power BI visual, let me know what it \nis in the comments below. Before you leave,  \nlike, subscribe and I'm going \nto see you in the next video.\n",
  "words": [
    "know",
    "ninety",
    "percent",
    "information",
    "processed",
    "brain",
    "visual",
    "human",
    "brain",
    "takes",
    "13",
    "milliseconds",
    "process",
    "image",
    "times",
    "faster",
    "processing",
    "text",
    "people",
    "also",
    "retain",
    "80",
    "see",
    "compared",
    "20",
    "read",
    "10",
    "hear",
    "wonder",
    "data",
    "visualization",
    "tools",
    "high",
    "demand",
    "visuals",
    "provide",
    "us",
    "effective",
    "way",
    "get",
    "point",
    "across",
    "especially",
    "nowadays",
    "dealing",
    "poor",
    "data",
    "ever",
    "visuals",
    "created",
    "equally",
    "though",
    "help",
    "uncover",
    "dangers",
    "opportunities",
    "never",
    "even",
    "knew",
    "look",
    "cover",
    "favorite",
    "power",
    "bi",
    "visuals",
    "wish",
    "excel",
    "going",
    "see",
    "easy",
    "turn",
    "data",
    "actionable",
    "decisions",
    "number",
    "one",
    "ribbon",
    "chart",
    "great",
    "viewing",
    "data",
    "time",
    "also",
    "keeping",
    "track",
    "rank",
    "changes",
    "right",
    "let",
    "add",
    "report",
    "get",
    "idea",
    "going",
    "look",
    "let",
    "bring",
    "life",
    "going",
    "add",
    "total",
    "quantity",
    "let",
    "add",
    "element",
    "time",
    "three",
    "months",
    "data",
    "model",
    "add",
    "months",
    "get",
    "something",
    "looks",
    "like",
    "column",
    "chart",
    "ribbon",
    "going",
    "form",
    "add",
    "category",
    "legend",
    "want",
    "take",
    "look",
    "different",
    "article",
    "categories",
    "developed",
    "time",
    "let",
    "add",
    "legend",
    "ribbon",
    "comes",
    "life",
    "way",
    "works",
    "highest",
    "range",
    "always",
    "displayed",
    "top",
    "see",
    "columns",
    "background",
    "stacked",
    "columns",
    "different",
    "categories",
    "hover",
    "see",
    "total",
    "quantity",
    "business",
    "casual",
    "clothing",
    "party",
    "beauty",
    "lighter",
    "areas",
    "get",
    "see",
    "rank",
    "changes",
    "like",
    "music",
    "charts",
    "get",
    "see",
    "change",
    "rank",
    "similar",
    "concept",
    "built",
    "business",
    "clothing",
    "dropped",
    "two",
    "ranks",
    "number",
    "one",
    "february",
    "became",
    "number",
    "three",
    "march",
    "one",
    "right",
    "casual",
    "clothing",
    "went",
    "one",
    "rank",
    "first",
    "place",
    "ribbon",
    "chart",
    "bit",
    "difficult",
    "read",
    "make",
    "adjustments",
    "make",
    "easier",
    "first",
    "turn",
    "title",
    "let",
    "turn",
    "data",
    "labels",
    "let",
    "also",
    "activate",
    "zoom",
    "slider",
    "want",
    "get",
    "closer",
    "look",
    "january",
    "bottom",
    "category",
    "zoom",
    "see",
    "oh",
    "yeah",
    "sleep",
    "category",
    "sold",
    "500",
    "items",
    "get",
    "quickly",
    "overcrowded",
    "many",
    "different",
    "categories",
    "could",
    "make",
    "sense",
    "add",
    "filter",
    "visual",
    "restrict",
    "top",
    "categories",
    "filter",
    "type",
    "would",
    "go",
    "top",
    "n",
    "going",
    "base",
    "total",
    "quantity",
    "say",
    "let",
    "take",
    "look",
    "top",
    "three",
    "categories",
    "number",
    "two",
    "decomposition",
    "tree",
    "ai",
    "visual",
    "lets",
    "visualize",
    "data",
    "across",
    "multiple",
    "dimensions",
    "going",
    "find",
    "right",
    "let",
    "add",
    "get",
    "pick",
    "fields",
    "want",
    "analyze",
    "going",
    "go",
    "profit",
    "decide",
    "want",
    "explain",
    "one",
    "field",
    "article",
    "category",
    "another",
    "customer",
    "gender",
    "perhaps",
    "customer",
    "city",
    "get",
    "plus",
    "show",
    "choose",
    "want",
    "split",
    "data",
    "select",
    "option",
    "different",
    "fields",
    "added",
    "also",
    "part",
    "high",
    "value",
    "low",
    "value",
    "notice",
    "light",
    "bulb",
    "ai",
    "feature",
    "might",
    "help",
    "uncover",
    "issues",
    "even",
    "know",
    "look",
    "let",
    "say",
    "going",
    "go",
    "low",
    "value",
    "ai",
    "going",
    "get",
    "work",
    "decide",
    "category",
    "show",
    "picked",
    "city",
    "garland",
    "negative",
    "profit",
    "coming",
    "let",
    "dig",
    "deeper",
    "low",
    "value",
    "sleep",
    "category",
    "go",
    "gender",
    "na",
    "picked",
    "want",
    "see",
    "apply",
    "pattern",
    "different",
    "values",
    "example",
    "la",
    "click",
    "going",
    "find",
    "low",
    "value",
    "picked",
    "gender",
    "coming",
    "casual",
    "clothing",
    "category",
    "see",
    "different",
    "categories",
    "female",
    "make",
    "selection",
    "see",
    "party",
    "lowest",
    "profit",
    "whatever",
    "want",
    "start",
    "process",
    "look",
    "something",
    "else",
    "could",
    "decide",
    "look",
    "high",
    "value",
    "time",
    "ai",
    "picked",
    "gender",
    "category",
    "also",
    "use",
    "ai",
    "feature",
    "could",
    "go",
    "slice",
    "dice",
    "want",
    "going",
    "go",
    "gender",
    "let",
    "drill",
    "male",
    "category",
    "notice",
    "party",
    "category",
    "making",
    "negative",
    "profit",
    "want",
    "see",
    "coming",
    "going",
    "drill",
    "city",
    "coming",
    "seattle",
    "want",
    "lock",
    "field",
    "place",
    "notice",
    "hover",
    "get",
    "lock",
    "icon",
    "always",
    "want",
    "first",
    "drill",
    "gender",
    "lock",
    "place",
    "leave",
    "rest",
    "flexible",
    "okay",
    "great",
    "visual",
    "getting",
    "information",
    "data",
    "even",
    "know",
    "look",
    "next",
    "scatter",
    "chart",
    "know",
    "excel",
    "one",
    "cool",
    "power",
    "bi",
    "check",
    "going",
    "add",
    "scatter",
    "chart",
    "let",
    "bring",
    "sales",
    "value",
    "profit",
    "total",
    "quantity",
    "going",
    "go",
    "size",
    "legend",
    "okay",
    "one",
    "bubble",
    "going",
    "split",
    "customer",
    "state",
    "going",
    "add",
    "state",
    "legend",
    "see",
    "different",
    "bubbles",
    "one",
    "california",
    "way",
    "makes",
    "different",
    "excel",
    "well",
    "part",
    "play",
    "axis",
    "add",
    "time",
    "factor",
    "dates",
    "right",
    "case",
    "three",
    "months",
    "data",
    "going",
    "grab",
    "month",
    "drop",
    "play",
    "axis",
    "also",
    "difficult",
    "read",
    "legend",
    "let",
    "go",
    "quickly",
    "format",
    "visual",
    "turn",
    "legend",
    "turn",
    "category",
    "labels",
    "let",
    "also",
    "make",
    "bigger",
    "okay",
    "california",
    "way",
    "march",
    "always",
    "like",
    "well",
    "let",
    "play",
    "see",
    "january",
    "february",
    "march",
    "data",
    "longer",
    "time",
    "periods",
    "going",
    "able",
    "play",
    "understand",
    "change",
    "time",
    "last",
    "infographics",
    "custom",
    "visuals",
    "see",
    "great",
    "thing",
    "power",
    "bi",
    "even",
    "restricted",
    "see",
    "go",
    "grab",
    "visuals",
    "get",
    "search",
    "want",
    "gon",
    "na",
    "go",
    "grab",
    "infographic",
    "designer",
    "let",
    "add",
    "successfully",
    "imported",
    "see",
    "bottom",
    "custom",
    "visual",
    "settings",
    "let",
    "show",
    "something",
    "cool",
    "one",
    "let",
    "add",
    "add",
    "gender",
    "total",
    "quantity",
    "going",
    "change",
    "measure",
    "show",
    "values",
    "percent",
    "grand",
    "total",
    "okay",
    "let",
    "go",
    "formatting",
    "options",
    "see",
    "get",
    "chart",
    "pick",
    "different",
    "types",
    "going",
    "stick",
    "column",
    "turn",
    "axis",
    "add",
    "shapes",
    "well",
    "add",
    "right",
    "okay",
    "let",
    "expand",
    "see",
    "options",
    "better",
    "bring",
    "get",
    "specific",
    "designer",
    "options",
    "add",
    "different",
    "shapes",
    "want",
    "want",
    "column",
    "different",
    "shape",
    "case",
    "want",
    "going",
    "go",
    "data",
    "binding",
    "select",
    "data",
    "binding",
    "field",
    "gender",
    "select",
    "different",
    "shape",
    "select",
    "pick",
    "different",
    "shapes",
    "people",
    "female",
    "one",
    "let",
    "go",
    "male",
    "one",
    "right",
    "find",
    "want",
    "problem",
    "upload",
    "svg",
    "file",
    "happen",
    "one",
    "let",
    "select",
    "add",
    "apply",
    "see",
    "update",
    "want",
    "height",
    "going",
    "go",
    "layout",
    "adjust",
    "setting",
    "outer",
    "okay",
    "things",
    "looking",
    "better",
    "want",
    "add",
    "filling",
    "based",
    "percentage",
    "fill",
    "percentage",
    "going",
    "based",
    "percentage",
    "total",
    "quantity",
    "notice",
    "female",
    "fully",
    "filled",
    "want",
    "going",
    "add",
    "maximum",
    "value",
    "filling",
    "updated",
    "accordingly",
    "options",
    "adjust",
    "color",
    "want",
    "going",
    "turn",
    "go",
    "light",
    "yellow",
    "color",
    "also",
    "add",
    "actual",
    "percentage",
    "go",
    "add",
    "text",
    "want",
    "text",
    "dynamic",
    "data",
    "label",
    "based",
    "percentage",
    "total",
    "quantity",
    "let",
    "apply",
    "go",
    "back",
    "adjust",
    "formatting",
    "let",
    "make",
    "really",
    "big",
    "make",
    "bold",
    "add",
    "bottom",
    "okay",
    "looks",
    "good",
    "let",
    "make",
    "smaller",
    "great",
    "thing",
    "works",
    "similar",
    "power",
    "bi",
    "visuals",
    "let",
    "say",
    "bar",
    "chart",
    "place",
    "showing",
    "profit",
    "different",
    "categories",
    "select",
    "different",
    "categories",
    "visual",
    "automatically",
    "hope",
    "brief",
    "introduction",
    "cool",
    "power",
    "bi",
    "visuals",
    "inspired",
    "creative",
    "design",
    "reports",
    "also",
    "experiment",
    "little",
    "bit",
    "takes",
    "two",
    "minutes",
    "maximum",
    "guess",
    "add",
    "new",
    "chart",
    "tweak",
    "bit",
    "see",
    "capable",
    "favorite",
    "power",
    "bi",
    "visual",
    "let",
    "know",
    "comments",
    "leave",
    "like",
    "subscribe",
    "going",
    "see",
    "next",
    "video"
  ],
  "keywords": [
    "know",
    "visual",
    "text",
    "also",
    "see",
    "read",
    "data",
    "high",
    "visuals",
    "way",
    "get",
    "even",
    "look",
    "power",
    "bi",
    "excel",
    "going",
    "turn",
    "number",
    "one",
    "ribbon",
    "chart",
    "great",
    "time",
    "rank",
    "right",
    "let",
    "add",
    "bring",
    "total",
    "quantity",
    "three",
    "months",
    "something",
    "like",
    "column",
    "category",
    "legend",
    "want",
    "different",
    "categories",
    "always",
    "top",
    "casual",
    "clothing",
    "party",
    "change",
    "two",
    "march",
    "first",
    "place",
    "bit",
    "make",
    "bottom",
    "could",
    "go",
    "say",
    "ai",
    "find",
    "pick",
    "profit",
    "decide",
    "field",
    "customer",
    "gender",
    "city",
    "show",
    "select",
    "value",
    "low",
    "notice",
    "picked",
    "coming",
    "apply",
    "female",
    "drill",
    "lock",
    "okay",
    "cool",
    "well",
    "play",
    "axis",
    "grab",
    "options",
    "shapes",
    "adjust",
    "based",
    "percentage"
  ]
}