{
  "text": "StatQuest breaks it down into bite-sized pieces, hooray!\nHello, I'm Josh Starmer and welcome to StatQuest. In this StatQuest we're going to\ngo through Principal Component Analysis (PCA) one step at a time using Singular Value Decomposition (SVD).\nYou'll learn about what PCA does, how it does it, and how to use it to get deeper insight into your data.\nLet's start with a simple data set.\nWe've measured the transcription of two genes, Gene 1 and Gene 2, in 6 different mice.\nNote: If you're not into mice and genes, think of the mice as individual samples and\nthe genes as variables that we measure for each sample.\nFor example, the samples could be students in high school and the variables could\nbe test scores in math and reading, or the samples could be businesses and the variables\ncould be market capitalization and the number of employees.\nOkay, now we're back to mice and genes, because I'm a geneticist and I work in a genetics department.\nIf we only measure one gene we can plot the data on a number line.\nMice 1, 2, and 3 have relatively high values and mice 4, 5, and 6 have relatively low values.\nEven though it's a simple graph, it shows us that mice 1, 2, and 3 are more similar\nto each other than they are to mice 4, 5, and 6.\nIf we measured 2 genes, then we can plot the data on a two-dimensional X-Y graph.\nGene 1 is the x-axis and spans one of the two dimensions in this graph.\nGene 2 is the y-axis and spans the other dimension.\nWe can see that mice 1, 2, and 3 cluster on the right side and mice 4, 5, and 6 cluster on the lower left hand side.\nIf we measured three genes, we would add another axis to the graph and make it look 3D, i.e. 3-dimensional.\nThe smaller dots have larger values for Gene 3 and are further away.\nThe larger dots have smaller values for Gene 3 and are closer.\nIf we measured 4 genes, however, we can no longer plot the data. 4  genes require\n4 dimensions.  So we're going to talk about how PCA can take 4 or more gene measurements,\nand thus 4 or more dimensions of data, and make a 2-dimensional PCA plot.\nThis plot will show us that similar mice cluster together.\nWe'll also talk about how PCA can tell us which gene, or variable, is the most valuable for clustering the data.\nFor example PCA might tell us that Gene 3 is responsible for separating samples along the x-axis.\nLastly, we'll talk about how PCA can tell us how accurate the 2D graph is.\nTo understand what PCA does and how it works, let's go back to the data set that only had 2 genes.\nWe'll start by plotting the data. Then we'll calculate the average measurement for\nGene 1, and the average measurement for Gene 2.\nWith the average values, we can calculate the center of the data.\nFrom this point on, we'll focus on what happens in the graph -  we no longer need the original data.\nNow, we'll shift the data so that the center is on top of the origin in the graph.\nNote: Shifting the data did not change how the data points are positioned relative to each other.\nThis point is still the highest one, and this is still the rightmost point, etc.\nNow that the data are centered on the origin, we can try to fit a line to it.\nTo do this, we start by drawing a random line that goes through the origin.\nThen we rotate the line until it fits the data as well as it can, given that it has to go through the origin.\nUltimately, this line fits best.\nBut I'm getting ahead of myself, first we need to talk about how PCA decides if a fit is good or not.\nSo, let's go back to the original random line that goes through the origin.\nTo quantify how good this line fits the data, PCA projects the data onto it and then\nit can either measure the distances from the data to the line and try to find the\nline that minimizes those distances, or it can try to find the line that maximizes\nthe distances from the projected points to the origin.\nIf those options don't seem equivalent to you, we can build intuition by looking at\nhow these distances shrink when the line fits better,\nwhile these distances get larger when the line fits better.\nNow, to understand what is going on in a mathematical way, let's just consider one data point.\nThis point is fixed and so is its distance from the origin.\nIn other words, the distance from the point to the origin doesn't change when the red dotted line rotates.\nWhen we project the point onto the line, we get a right angle between the black dotted\nline and the red dotted line. That means that if we label the sides like this: A,\nB, and C, then we can use the Pythagorean theorem to show how B and C are inversely related.\nSince A, and thus A squared, doesn't change if B gets bigger then C must get smaller.\nLikewise, if C gets bigger then B must get smaller.\nThus, PCA can either minimize the distance to the line, or maximize the distance from the projected point to the origin.\nThe reason I'm making such a fuss about this is that, intuitively, it makes sense\nto minimize B and the distance from the point to the line, but it's actually easier\nto calculate C, the distance from the projected point to the origin, so PCA finds\nthe best fitting line by maximizing the sum of the squared distances from the projected points to the origin.\nSo, for this line, PCA projects the data onto it and then measures the distance from\nthis point to the origin, let's call it D1.\nNote: I'm going to keep track of the distances we measure up here.\nAnd then PCA measures the distance from this point to the origin, we'll call that D2.\nThen it measures D3, D4, D5, and D6.\nHere are all six distances that we measured.\nThe next thing we do is square all of them.\nThe distances are squared so that negative values don't cancel out positive values.\nThen we sum up all these squared distances, and that equals the sum of the squared distances.\nFor short we'll call this SS distances, for sum of squared distances.\nNow we rotate the line, project the data onto the line, and then sum up the squared\ndistances from the projected points to the origin. And we repeat until we end up\nwith the line with the largest sum of squared distances between the projected points and the origin.\nUltimately, we end up with this line.\nIt has the largest sum of squared distances.\nThis line is called Principal Component 1, or PC1 for short.\nPC1 has a slope of 0.25. In other words, for every 4 units that we go out along the\nGene 1 axis, we go up 1 unit along the Gene 2 axis. That means that the data are\nmostly spread out along the Gene 1 axis, and only a little bit spread out along the Gene 2 axis.\nOne way to think about PC1 is in terms of a cocktail recipe.\nTo make PC1 mix four parts Gene 1 with one part Gene 2.\nPour over ice and serve!\nThe ratio of Gene 1 to Gene 2 tells you that Gene 1 is more important when it comes\nto describing how the data are spread out.\nOh no, terminology alert!\nMathematicians call this cocktail recipe a linear combination of Genes 1 and 2.\nI mention this because when someone says PC1 is a linear combination of variables,\nthis is what they're talking about.  It's no big deal.\nThe recipe for PC1, going over 4 and up 1 gets us to this point.\nWe can solve for the length of the red line using the Pythagorean theorem, the old\nA squared equals B squared plus C squared.\nPlugging in the numbers gives us A equals 4.12.\nSo the length of the red line is 4.12.\nWhen you do PCA with SVD, the recipe for PC1 is scaled so that this length equals 1.\nAll we have to do to scale the triangle so that the red line is 1 unit long is to divide each side by 4.12.\nFor those of you keeping score, here's the math worked out that shows that all we\nneed to do is divide all 3 sides by 4.12.\nHere are the scaled values.\nThe new values change our recipe, but the ratio is the same.\nWe still use four times as much Gene 1 as Gene 2.\nSo now we are back to looking at the data, the best fitting line, and the unit vector that we just calculated.\nOh no, another terminology alert!\nThis 1 unit long vector, consisting of 0.97 parts Gene 1 and 0.242 parts Gene 2, is\ncalled the Singular Vector, or the Eigenvector for PC1, and the proportions of each gene are called loading scores.\nAlso while I'm at it, PCA calls the average of the sums of the squared distances for\nthe best fit line the Eigenvalue for PC1. And the square root of the sums of the\nsquared distances is called the Singular Value for PC1.\nBam! That's a lot of terminology.\nNow that we've got PC1 all figured out let's work on PC2. Because this is only a two-dimensional\ngraph, PC2 is simply the line through the origin that is perpendicular to PC1 without\nany further optimization that has to be done. And this means that the recipe for\nPC2 is -1 parts Gene 1 to 4 parts Gene 2.\nIf we scale everything so that we get a unit vector, the recipe is -0.242 parts Gene 1 and 0.97 parts Gene 2.\nThis is the singular vector for PC2 or the eigenvector for PC2. These are the loading\nscores for PC2, they tell us that, in terms of how the values are projected onto\nPC2, Gene 2 is 4 times as important as Gene 1.\nLastly the eigenvalue for PC2 is the average of the sum of the squares of the distances\nbetween the projected points and the origin. Hooray! We've worked out PC1 and PC2!\nTo draw the final PCA plot, we simply rotate everything so that PC1 is horizontal.\nThen we use the projected points to find where the samples go in the PCA plot. For\nexample, these projected points correspond to sample 6, so sample 6 goes here. Sample\n2 goes here. And Sample 1 goes here. Etc. Double bam! That's how PCA is done using\nsingular value decomposition. Okay, one last thing before we dive into a slightly\nmore complicated example. Remember the eigenvalues?\nWe got those by projecting the data onto the principal components, measuring the distances\nto the origin, then squaring and adding them together. Well, if you're familiar with\nthe equation for variation, you will notice that eigenvalues are just measures of\nvariation. For the sake of this example imagine that the variation for PC1 equals\n15 and the variation for PC2 equals 3. That means that the total variation around both PCS is 15 plus 3 equals 18.\nAnd that means PC1 accounts for 15 divided by 18 equals 0.83 or 83% of the total variation\naround the PCs. PC2 accounts for 3 divided by 18 equals 17% of the total variation\naround the PCs. Oh no another terminology alert! A scree plot is a graphical representation\nof the percentages of variation that each PC accounts for. We'll talk more about\nscree plots later. Bam. Okay, now let's quickly go through a slightly more complicated\nexample. PCA with 3 variables, in this case that means 3 genes, is pretty much the\nsame as 2 variables. You center the data. You then find the best fitting line that\ngoes through the origin. Just like before, the best fitting line is PC1. But the\nrecipe for PC1 now has 3 ingredients. In this case Gene 3 is the most important ingredient\nfor PC1. You then find PC2, the next best fitting line given that it goes through\nthe origin and is perpendicular to PC1. Here's the recipe for PC2. In this case Gene\n1 is the most important ingredient for PC2. Lastly, we find PC3, the best fitting\nline that goes through the origin and is perpendicular PC1 and PC2. If we had more\ngenes, we just keep on finding more and more principal components by adding perpendicular\nlines and rotating them. In theory, there is 1 per gene or variable, but in practice\nthe number of PCs is either the number of variables or the number of samples, whichever\nis smaller. If this is confusing, don't sweat it. It's not super important and I'm\ngoing to make a separate video on this topic in the next week. Once you have all\nthe principal components figured out you can use the eigenvalues, i.e. the sums of\nsquares of the distances, to determine the proportion of variation that each PC accounts\nfor. In this case, PC1 accounts for 79% of the variation, PC2 accounts for 15% of\nthe variation and PC3 accounts for 6% of the variation. Here's the scree plot. PC1\nand PC2 account for the vast majority of the variation. That means that a 2D graph,\nusing just PC1 and PC2, would be a good approximation of this 3D graph, since it\nwould account for 94% of the variation in the data. To convert the 3D graph into\na two-dimensional PCA graph, we just strip away everything but the data and PC1 and\nPC2, then project the samples onto PC1 and PC2. Then we rotate so that PC1 is horizontal\nand PC2 is vertical. This just makes it easier to look at. Since these projected\npoints correspond to sample 4, this is where sample 4 goes in our new PCA plot. etc.\netc. etc. Double bam! To review, we started with an awkward 3D graph that was kind\nof hard to read, then we calculated the principal components, then, with the eigenvalues\nfor PC1 and PC2, we determined that a 2D graph would still be very informative. Lastly,\nwe used PC1 and PC2 to draw a two-dimensional graph with the data. If we measured\n4 genes per mouse, we would not be able to draw a 4-dimensional graph of the data,\nbut that doesn't stop us from doing the PCA math, which doesn't care if we can draw\na picture of it or not, and looking at the scree plot. In this case, PC1 and PC2\naccount for 90% of the variation, so we can just use those to draw a 2-dimensional\nPCA graph. So we project the samples onto the first 2 PCs. These 2 projected points\ncorrespond to sample 2, so sample 2 goes here. Bam! Note, if the scree plot looked\nlike this, where PC3 and PC4 account for a substantial amount of variation, then\njust using the first two PCs would not create a very accurate representation of the\ndata. However, even a noisy PCA plot like this can be used to identify clusters of\ndata. These samples are still more similar to each other than they are to the other\nsamples. Little bam. Hooray! We've made it to the end of another exciting StatQuest.\nIf you liked this StatQuest and want to see more, please subscribe. And if you want\nto support StatQuest, please consider buying one or two of my original songs, the\nlink to my bandcamp page is in the lower right corner and in the description below. All right until next time quest on!\n",
  "words": [
    "statquest",
    "breaks",
    "pieces",
    "hooray",
    "hello",
    "josh",
    "starmer",
    "welcome",
    "statquest",
    "statquest",
    "going",
    "go",
    "principal",
    "component",
    "analysis",
    "pca",
    "one",
    "step",
    "time",
    "using",
    "singular",
    "value",
    "decomposition",
    "svd",
    "learn",
    "pca",
    "use",
    "get",
    "deeper",
    "insight",
    "data",
    "let",
    "start",
    "simple",
    "data",
    "set",
    "measured",
    "transcription",
    "two",
    "genes",
    "gene",
    "1",
    "gene",
    "2",
    "6",
    "different",
    "mice",
    "note",
    "mice",
    "genes",
    "think",
    "mice",
    "individual",
    "samples",
    "genes",
    "variables",
    "measure",
    "sample",
    "example",
    "samples",
    "could",
    "students",
    "high",
    "school",
    "variables",
    "could",
    "test",
    "scores",
    "math",
    "reading",
    "samples",
    "could",
    "businesses",
    "variables",
    "could",
    "market",
    "capitalization",
    "number",
    "employees",
    "okay",
    "back",
    "mice",
    "genes",
    "geneticist",
    "work",
    "genetics",
    "department",
    "measure",
    "one",
    "gene",
    "plot",
    "data",
    "number",
    "line",
    "mice",
    "1",
    "2",
    "3",
    "relatively",
    "high",
    "values",
    "mice",
    "4",
    "5",
    "6",
    "relatively",
    "low",
    "values",
    "even",
    "though",
    "simple",
    "graph",
    "shows",
    "us",
    "mice",
    "1",
    "2",
    "3",
    "similar",
    "mice",
    "4",
    "5",
    "measured",
    "2",
    "genes",
    "plot",
    "data",
    "graph",
    "gene",
    "1",
    "spans",
    "one",
    "two",
    "dimensions",
    "graph",
    "gene",
    "2",
    "spans",
    "dimension",
    "see",
    "mice",
    "1",
    "2",
    "3",
    "cluster",
    "right",
    "side",
    "mice",
    "4",
    "5",
    "6",
    "cluster",
    "lower",
    "left",
    "hand",
    "side",
    "measured",
    "three",
    "genes",
    "would",
    "add",
    "another",
    "axis",
    "graph",
    "make",
    "look",
    "3d",
    "smaller",
    "dots",
    "larger",
    "values",
    "gene",
    "3",
    "away",
    "larger",
    "dots",
    "smaller",
    "values",
    "gene",
    "3",
    "closer",
    "measured",
    "4",
    "genes",
    "however",
    "longer",
    "plot",
    "data",
    "4",
    "genes",
    "require",
    "4",
    "dimensions",
    "going",
    "talk",
    "pca",
    "take",
    "4",
    "gene",
    "measurements",
    "thus",
    "4",
    "dimensions",
    "data",
    "make",
    "pca",
    "plot",
    "plot",
    "show",
    "us",
    "similar",
    "mice",
    "cluster",
    "together",
    "also",
    "talk",
    "pca",
    "tell",
    "us",
    "gene",
    "variable",
    "valuable",
    "clustering",
    "data",
    "example",
    "pca",
    "might",
    "tell",
    "us",
    "gene",
    "3",
    "responsible",
    "separating",
    "samples",
    "along",
    "lastly",
    "talk",
    "pca",
    "tell",
    "us",
    "accurate",
    "2d",
    "graph",
    "understand",
    "pca",
    "works",
    "let",
    "go",
    "back",
    "data",
    "set",
    "2",
    "genes",
    "start",
    "plotting",
    "data",
    "calculate",
    "average",
    "measurement",
    "gene",
    "1",
    "average",
    "measurement",
    "gene",
    "average",
    "values",
    "calculate",
    "center",
    "data",
    "point",
    "focus",
    "happens",
    "graph",
    "longer",
    "need",
    "original",
    "data",
    "shift",
    "data",
    "center",
    "top",
    "origin",
    "graph",
    "note",
    "shifting",
    "data",
    "change",
    "data",
    "points",
    "positioned",
    "relative",
    "point",
    "still",
    "highest",
    "one",
    "still",
    "rightmost",
    "point",
    "etc",
    "data",
    "centered",
    "origin",
    "try",
    "fit",
    "line",
    "start",
    "drawing",
    "random",
    "line",
    "goes",
    "origin",
    "rotate",
    "line",
    "fits",
    "data",
    "well",
    "given",
    "go",
    "origin",
    "ultimately",
    "line",
    "fits",
    "best",
    "getting",
    "ahead",
    "first",
    "need",
    "talk",
    "pca",
    "decides",
    "fit",
    "good",
    "let",
    "go",
    "back",
    "original",
    "random",
    "line",
    "goes",
    "origin",
    "quantify",
    "good",
    "line",
    "fits",
    "data",
    "pca",
    "projects",
    "data",
    "onto",
    "either",
    "measure",
    "distances",
    "data",
    "line",
    "try",
    "find",
    "line",
    "minimizes",
    "distances",
    "try",
    "find",
    "line",
    "maximizes",
    "distances",
    "projected",
    "points",
    "origin",
    "options",
    "seem",
    "equivalent",
    "build",
    "intuition",
    "looking",
    "distances",
    "shrink",
    "line",
    "fits",
    "better",
    "distances",
    "get",
    "larger",
    "line",
    "fits",
    "better",
    "understand",
    "going",
    "mathematical",
    "way",
    "let",
    "consider",
    "one",
    "data",
    "point",
    "point",
    "fixed",
    "distance",
    "origin",
    "words",
    "distance",
    "point",
    "origin",
    "change",
    "red",
    "dotted",
    "line",
    "rotates",
    "project",
    "point",
    "onto",
    "line",
    "get",
    "right",
    "angle",
    "black",
    "dotted",
    "line",
    "red",
    "dotted",
    "line",
    "means",
    "label",
    "sides",
    "like",
    "b",
    "c",
    "use",
    "pythagorean",
    "theorem",
    "show",
    "b",
    "c",
    "inversely",
    "related",
    "since",
    "thus",
    "squared",
    "change",
    "b",
    "gets",
    "bigger",
    "c",
    "must",
    "get",
    "smaller",
    "likewise",
    "c",
    "gets",
    "bigger",
    "b",
    "must",
    "get",
    "smaller",
    "thus",
    "pca",
    "either",
    "minimize",
    "distance",
    "line",
    "maximize",
    "distance",
    "projected",
    "point",
    "origin",
    "reason",
    "making",
    "fuss",
    "intuitively",
    "makes",
    "sense",
    "minimize",
    "b",
    "distance",
    "point",
    "line",
    "actually",
    "easier",
    "calculate",
    "c",
    "distance",
    "projected",
    "point",
    "origin",
    "pca",
    "finds",
    "best",
    "fitting",
    "line",
    "maximizing",
    "sum",
    "squared",
    "distances",
    "projected",
    "points",
    "origin",
    "line",
    "pca",
    "projects",
    "data",
    "onto",
    "measures",
    "distance",
    "point",
    "origin",
    "let",
    "call",
    "d1",
    "note",
    "going",
    "keep",
    "track",
    "distances",
    "measure",
    "pca",
    "measures",
    "distance",
    "point",
    "origin",
    "call",
    "d2",
    "measures",
    "d3",
    "d4",
    "d5",
    "d6",
    "six",
    "distances",
    "measured",
    "next",
    "thing",
    "square",
    "distances",
    "squared",
    "negative",
    "values",
    "cancel",
    "positive",
    "values",
    "sum",
    "squared",
    "distances",
    "equals",
    "sum",
    "squared",
    "distances",
    "short",
    "call",
    "ss",
    "distances",
    "sum",
    "squared",
    "distances",
    "rotate",
    "line",
    "project",
    "data",
    "onto",
    "line",
    "sum",
    "squared",
    "distances",
    "projected",
    "points",
    "origin",
    "repeat",
    "end",
    "line",
    "largest",
    "sum",
    "squared",
    "distances",
    "projected",
    "points",
    "origin",
    "ultimately",
    "end",
    "line",
    "largest",
    "sum",
    "squared",
    "distances",
    "line",
    "called",
    "principal",
    "component",
    "1",
    "pc1",
    "short",
    "pc1",
    "slope",
    "words",
    "every",
    "4",
    "units",
    "go",
    "along",
    "gene",
    "1",
    "axis",
    "go",
    "1",
    "unit",
    "along",
    "gene",
    "2",
    "axis",
    "means",
    "data",
    "mostly",
    "spread",
    "along",
    "gene",
    "1",
    "axis",
    "little",
    "bit",
    "spread",
    "along",
    "gene",
    "2",
    "axis",
    "one",
    "way",
    "think",
    "pc1",
    "terms",
    "cocktail",
    "recipe",
    "make",
    "pc1",
    "mix",
    "four",
    "parts",
    "gene",
    "1",
    "one",
    "part",
    "gene",
    "pour",
    "ice",
    "serve",
    "ratio",
    "gene",
    "1",
    "gene",
    "2",
    "tells",
    "gene",
    "1",
    "important",
    "comes",
    "describing",
    "data",
    "spread",
    "oh",
    "terminology",
    "alert",
    "mathematicians",
    "call",
    "cocktail",
    "recipe",
    "linear",
    "combination",
    "genes",
    "1",
    "mention",
    "someone",
    "says",
    "pc1",
    "linear",
    "combination",
    "variables",
    "talking",
    "big",
    "deal",
    "recipe",
    "pc1",
    "going",
    "4",
    "1",
    "gets",
    "us",
    "point",
    "solve",
    "length",
    "red",
    "line",
    "using",
    "pythagorean",
    "theorem",
    "old",
    "squared",
    "equals",
    "b",
    "squared",
    "plus",
    "c",
    "squared",
    "plugging",
    "numbers",
    "gives",
    "us",
    "equals",
    "length",
    "red",
    "line",
    "pca",
    "svd",
    "recipe",
    "pc1",
    "scaled",
    "length",
    "equals",
    "scale",
    "triangle",
    "red",
    "line",
    "1",
    "unit",
    "long",
    "divide",
    "side",
    "keeping",
    "score",
    "math",
    "worked",
    "shows",
    "need",
    "divide",
    "3",
    "sides",
    "scaled",
    "values",
    "new",
    "values",
    "change",
    "recipe",
    "ratio",
    "still",
    "use",
    "four",
    "times",
    "much",
    "gene",
    "1",
    "gene",
    "back",
    "looking",
    "data",
    "best",
    "fitting",
    "line",
    "unit",
    "vector",
    "calculated",
    "oh",
    "another",
    "terminology",
    "alert",
    "1",
    "unit",
    "long",
    "vector",
    "consisting",
    "parts",
    "gene",
    "1",
    "parts",
    "gene",
    "2",
    "called",
    "singular",
    "vector",
    "eigenvector",
    "pc1",
    "proportions",
    "gene",
    "called",
    "loading",
    "scores",
    "also",
    "pca",
    "calls",
    "average",
    "sums",
    "squared",
    "distances",
    "best",
    "fit",
    "line",
    "eigenvalue",
    "pc1",
    "square",
    "root",
    "sums",
    "squared",
    "distances",
    "called",
    "singular",
    "value",
    "pc1",
    "bam",
    "lot",
    "terminology",
    "got",
    "pc1",
    "figured",
    "let",
    "work",
    "pc2",
    "graph",
    "pc2",
    "simply",
    "line",
    "origin",
    "perpendicular",
    "pc1",
    "without",
    "optimization",
    "done",
    "means",
    "recipe",
    "pc2",
    "parts",
    "gene",
    "1",
    "4",
    "parts",
    "gene",
    "scale",
    "everything",
    "get",
    "unit",
    "vector",
    "recipe",
    "parts",
    "gene",
    "1",
    "parts",
    "gene",
    "singular",
    "vector",
    "pc2",
    "eigenvector",
    "pc2",
    "loading",
    "scores",
    "pc2",
    "tell",
    "us",
    "terms",
    "values",
    "projected",
    "onto",
    "pc2",
    "gene",
    "2",
    "4",
    "times",
    "important",
    "gene",
    "lastly",
    "eigenvalue",
    "pc2",
    "average",
    "sum",
    "squares",
    "distances",
    "projected",
    "points",
    "origin",
    "hooray",
    "worked",
    "pc1",
    "pc2",
    "draw",
    "final",
    "pca",
    "plot",
    "simply",
    "rotate",
    "everything",
    "pc1",
    "horizontal",
    "use",
    "projected",
    "points",
    "find",
    "samples",
    "go",
    "pca",
    "plot",
    "example",
    "projected",
    "points",
    "correspond",
    "sample",
    "6",
    "sample",
    "6",
    "goes",
    "sample",
    "2",
    "goes",
    "sample",
    "1",
    "goes",
    "etc",
    "double",
    "bam",
    "pca",
    "done",
    "using",
    "singular",
    "value",
    "decomposition",
    "okay",
    "one",
    "last",
    "thing",
    "dive",
    "slightly",
    "complicated",
    "example",
    "remember",
    "eigenvalues",
    "got",
    "projecting",
    "data",
    "onto",
    "principal",
    "components",
    "measuring",
    "distances",
    "origin",
    "squaring",
    "adding",
    "together",
    "well",
    "familiar",
    "equation",
    "variation",
    "notice",
    "eigenvalues",
    "measures",
    "variation",
    "sake",
    "example",
    "imagine",
    "variation",
    "pc1",
    "equals",
    "15",
    "variation",
    "pc2",
    "equals",
    "means",
    "total",
    "variation",
    "around",
    "pcs",
    "15",
    "plus",
    "3",
    "equals",
    "means",
    "pc1",
    "accounts",
    "15",
    "divided",
    "18",
    "equals",
    "83",
    "total",
    "variation",
    "around",
    "pcs",
    "pc2",
    "accounts",
    "3",
    "divided",
    "18",
    "equals",
    "17",
    "total",
    "variation",
    "around",
    "pcs",
    "oh",
    "another",
    "terminology",
    "alert",
    "scree",
    "plot",
    "graphical",
    "representation",
    "percentages",
    "variation",
    "pc",
    "accounts",
    "talk",
    "scree",
    "plots",
    "later",
    "bam",
    "okay",
    "let",
    "quickly",
    "go",
    "slightly",
    "complicated",
    "example",
    "pca",
    "3",
    "variables",
    "case",
    "means",
    "3",
    "genes",
    "pretty",
    "much",
    "2",
    "variables",
    "center",
    "data",
    "find",
    "best",
    "fitting",
    "line",
    "goes",
    "origin",
    "like",
    "best",
    "fitting",
    "line",
    "pc1",
    "recipe",
    "pc1",
    "3",
    "ingredients",
    "case",
    "gene",
    "3",
    "important",
    "ingredient",
    "pc1",
    "find",
    "pc2",
    "next",
    "best",
    "fitting",
    "line",
    "given",
    "goes",
    "origin",
    "perpendicular",
    "pc1",
    "recipe",
    "pc2",
    "case",
    "gene",
    "1",
    "important",
    "ingredient",
    "pc2",
    "lastly",
    "find",
    "pc3",
    "best",
    "fitting",
    "line",
    "goes",
    "origin",
    "perpendicular",
    "pc1",
    "pc2",
    "genes",
    "keep",
    "finding",
    "principal",
    "components",
    "adding",
    "perpendicular",
    "lines",
    "rotating",
    "theory",
    "1",
    "per",
    "gene",
    "variable",
    "practice",
    "number",
    "pcs",
    "either",
    "number",
    "variables",
    "number",
    "samples",
    "whichever",
    "smaller",
    "confusing",
    "sweat",
    "super",
    "important",
    "going",
    "make",
    "separate",
    "video",
    "topic",
    "next",
    "week",
    "principal",
    "components",
    "figured",
    "use",
    "eigenvalues",
    "sums",
    "squares",
    "distances",
    "determine",
    "proportion",
    "variation",
    "pc",
    "accounts",
    "case",
    "pc1",
    "accounts",
    "79",
    "variation",
    "pc2",
    "accounts",
    "15",
    "variation",
    "pc3",
    "accounts",
    "6",
    "variation",
    "scree",
    "plot",
    "pc1",
    "pc2",
    "account",
    "vast",
    "majority",
    "variation",
    "means",
    "2d",
    "graph",
    "using",
    "pc1",
    "pc2",
    "would",
    "good",
    "approximation",
    "3d",
    "graph",
    "since",
    "would",
    "account",
    "94",
    "variation",
    "data",
    "convert",
    "3d",
    "graph",
    "pca",
    "graph",
    "strip",
    "away",
    "everything",
    "data",
    "pc1",
    "pc2",
    "project",
    "samples",
    "onto",
    "pc1",
    "pc2",
    "rotate",
    "pc1",
    "horizontal",
    "pc2",
    "vertical",
    "makes",
    "easier",
    "look",
    "since",
    "projected",
    "points",
    "correspond",
    "sample",
    "4",
    "sample",
    "4",
    "goes",
    "new",
    "pca",
    "plot",
    "etc",
    "etc",
    "etc",
    "double",
    "bam",
    "review",
    "started",
    "awkward",
    "3d",
    "graph",
    "kind",
    "hard",
    "read",
    "calculated",
    "principal",
    "components",
    "eigenvalues",
    "pc1",
    "pc2",
    "determined",
    "2d",
    "graph",
    "would",
    "still",
    "informative",
    "lastly",
    "used",
    "pc1",
    "pc2",
    "draw",
    "graph",
    "data",
    "measured",
    "4",
    "genes",
    "per",
    "mouse",
    "would",
    "able",
    "draw",
    "graph",
    "data",
    "stop",
    "us",
    "pca",
    "math",
    "care",
    "draw",
    "picture",
    "looking",
    "scree",
    "plot",
    "case",
    "pc1",
    "pc2",
    "account",
    "90",
    "variation",
    "use",
    "draw",
    "pca",
    "graph",
    "project",
    "samples",
    "onto",
    "first",
    "2",
    "pcs",
    "2",
    "projected",
    "points",
    "correspond",
    "sample",
    "2",
    "sample",
    "2",
    "goes",
    "bam",
    "note",
    "scree",
    "plot",
    "looked",
    "like",
    "pc3",
    "pc4",
    "account",
    "substantial",
    "amount",
    "variation",
    "using",
    "first",
    "two",
    "pcs",
    "would",
    "create",
    "accurate",
    "representation",
    "data",
    "however",
    "even",
    "noisy",
    "pca",
    "plot",
    "like",
    "used",
    "identify",
    "clusters",
    "data",
    "samples",
    "still",
    "similar",
    "samples",
    "little",
    "bam",
    "hooray",
    "made",
    "end",
    "another",
    "exciting",
    "statquest",
    "liked",
    "statquest",
    "want",
    "see",
    "please",
    "subscribe",
    "want",
    "support",
    "statquest",
    "please",
    "consider",
    "buying",
    "one",
    "two",
    "original",
    "songs",
    "link",
    "bandcamp",
    "page",
    "lower",
    "right",
    "corner",
    "description",
    "right",
    "next",
    "time",
    "quest"
  ],
  "keywords": [
    "statquest",
    "going",
    "go",
    "principal",
    "pca",
    "one",
    "using",
    "singular",
    "use",
    "get",
    "data",
    "let",
    "measured",
    "two",
    "genes",
    "gene",
    "1",
    "2",
    "6",
    "mice",
    "note",
    "samples",
    "variables",
    "measure",
    "sample",
    "example",
    "could",
    "number",
    "back",
    "plot",
    "line",
    "3",
    "values",
    "4",
    "graph",
    "us",
    "right",
    "would",
    "another",
    "axis",
    "make",
    "3d",
    "smaller",
    "talk",
    "tell",
    "along",
    "lastly",
    "average",
    "point",
    "origin",
    "change",
    "points",
    "still",
    "etc",
    "goes",
    "rotate",
    "fits",
    "best",
    "onto",
    "distances",
    "find",
    "projected",
    "distance",
    "red",
    "project",
    "means",
    "like",
    "b",
    "c",
    "squared",
    "fitting",
    "sum",
    "measures",
    "call",
    "next",
    "equals",
    "called",
    "pc1",
    "unit",
    "recipe",
    "parts",
    "important",
    "terminology",
    "vector",
    "bam",
    "pc2",
    "perpendicular",
    "draw",
    "eigenvalues",
    "components",
    "variation",
    "15",
    "pcs",
    "accounts",
    "scree",
    "case",
    "account"
  ]
}